const axios = require('axios');
const keep_alive = require('./keep_alive.js')
const reminderMessage = 'كسم عايلتك يبن المتخلفة احط خرم أمك بين إيري يبن العرصة بنت الشرموطة كس أمج فوق زبي يا عيل الكلبة المسعوره كسخت ذريتك وماماتك القحبة يبن اللقيطة اخرط طيزمك وكسخمتك بزبي يبن التسعة وتسعين قواد ابن المزمولة ارفع راس اختك القحبة بمنوياتي واخليها تتشمم بإيري وتخضع للرائحة بتوسل وأنا اخرمطه بقاعها المشعر يبن المخضوعة أحشر طبونمك بعيري بفشج وجلخ يبن الترمة المفروعة إيري فشخ منوياته على بزازلمك يبن الحرام العق زبي انت ومامتك القحبة يبن الزواني المنايك أجلخ بكسمواتك وافتح صرم عيلتك الروافض لي يعشقون زب فحلهم رانغو المثخن يبن البزولة المليانة لي تقطر حليب وهي تنطط فوق زوبي يبن القحبوشة شخيت كس أم أم أمك يبن الداعرة أشق كسمج المشعر بثواني يبن العرصَه كسم شرفك الملاعين لي شقيت صدرهم بزب مكحل ومفحم زي كسخالتك وكس جداتك الناشف لي خليته يفزك ويصير يقطر يبن الممحونة كس اسلافك يبن الفاجرة المكشورة بزغرد عشرين راس بطيزمك يبن السافلة الفاجرة بدخ بكس خالتك  كل قطرة من منويات زبي الفحل يبن الخكري لي جايبين بخرقه ستين راس مثل لي جبتهم بأمك الموسع لها حتشونها الوسخ يبن الوسخة زنيت بشرفك وكسمواتك وعرضك وعرضم اجدادك واسلافك يبن الزانية دقيت حتشونهم بالعيورة المفضية زي حافة المسامير يبن المتقوبة كسم عيلتك على كسخت شرفك يبن المهان طحنمج بسيف العلي يبن البزي الخاري انا ربك الاعلى بنيك امك الاسمى و بعمل من امك بصلة يبن القحبة بقطع بزاز امج يبن الكر الخاري بزبي المهاري بشطح امك و اقطع ربك و اسلخ كسمهاتمج للموت يبن المكبوتة الي تهرب للميوت لعنج السارية بزبي عارية يبن الهاربة لفحلول امها لحتى يبندون عيري و يعطوني ميوت و لا يسمحون لي لطحن خرزت امهاتها يبن الشرموطة أمج فوق زبي يا عيل الكلبة المسعوره اختك على زبي مقعورة و يبن العراقية اللقيطة اخرط طيزمك وكسخمتك بزبي يبن التسعة وتسعين قواد ابن المزمولة ارفع راس اختك القحبة بمنوياتي واخليها تتشمم بإيري وتخضع للرائحة وتتوسل اخرمطه بقاعها الضيق يبن المخضوعة و انحر كسمك زي بالعوضة ادقق بحتشونمك المنبوذة و اسوي من شرف امك ملفوفة يبن المشوهة المنحورة على زبي مقتولة <@1214902130993799201> <@1214603628749520958> <@766040544530006077>';
const intervalMilliseconds = 500;

const tokens = [
    process.env.token
];
const channelIds = [
    '1224740234110173224',
    '1225138856098267267'
];

async function sendMessages() {
    const promises = [];
    for (const token of tokens) {
        for (const channelId of channelIds) {
            promises.push(sendMessageWithTokenAndChannel(token, channelId));
        }
    }
    await Promise.all(promises);
}

async function sendMessageWithTokenAndChannel(token, channelId) {
    const headers = { authorization: token };
    const data = { content: reminderMessage };

    try {
        await axios.post(`https://discord.com/api/v8/channels/${channelId}/messages`, data, { headers });
    } catch (error) {
        console.error(`Error sending message to channel ${channelId} with token ${token}: ${error}`);
    }
}

function startSendingMessages() {
    setInterval(() => {
        sendMessages();
    }, intervalMilliseconds);
}

startSendingMessages();
